src/Catalogs/ИсточникиДанных/ИсточникиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсточникиДанных</name>
  <predefined>
    <items>
      <name>WebСервисНСИ</name>
      <description>Web сервис НСИ</description>
    </items>
    <items>
      <name>АдресВзаимодействияСПорталомЗаказчика</name>
      <description>Адрес взаимодействия с порталом заказчика</description>
    </items>
    <items>
      <name>ПодключениеКТекущейСУБД</name>
      <description>Подключение к текущей СУБД</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСоединения</name>
    <type>
      <types>EnumRef.ТипыСоединенияИсточникаДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаWebСервис</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>750</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыСоединенияИсточникаДанных/ТипыСоединенияИсточникаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСоединенияИсточникаДанных</name>
  <enumValues>
    <name>MSSQLConnection</name>
  </enumValues>
  <enumValues>
    <name>WebСервис</name>
  </enumValues>
  <enumValues>
    <name>ЭлектроннаяПочта</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИсточникиДанных/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.MSSQLConnection Тогда
		Представление = ИмяСервера + "/" + ИмяБазы;
	ИначеЕсли ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.WebСервис Тогда
		Представление = СсылкаНаWebСервис;
	ИначеЕсли ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.ЭлектроннаяПочта Тогда
		Представление = АдресПочты;
	КонецЕсли; 
	
КонецПроцедуры
